#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Format 🤖`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bluemage/bloodbot/runs/run-kBZ9YUCf6tdyzh54

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
null_resource.example: Refreshing state... [id=7109877742741326575]
module.lambda_function.data.external.archive_prepare[0]: Reading...
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=a1f098750a7d9424c6da0f3e853de1a08ac47497]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=8627039622919663006]
module.s3_bucket.data.aws_canonical_user_id.this: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.lambda_function.data.aws_region.current: Reading...
module.lambda_function.data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.lambda_function.data.aws_partition.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=bloodbot-state-storage]
data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/bloodbot]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2423734833]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=bloodbot]
module.eventbridge.aws_iam_role.eventbridge[0]: Refreshing state... [id=default]
data.aws_caller_identity.current: Read complete after 0s [id=573908012280]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=573908012280]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=573908012280]
module.s3_bucket.data.aws_canonical_user_id.this: Read complete after 0s [id=d437de9841be7b0448578b615b4cceb1f3aea5f51de78171afba3bc511d4d96e]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3969223859]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::573908012280:policy/bloodbot-logs]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=bloodbot-state-storage,private]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=bloodbot-state-storage]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=bloodbot-state-storage]
module.lambda_function.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=236293281]
module.lambda_function.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::573908012280:policy/bloodbot-inline]
module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=bloodbot-20220925014630948600000001]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=bloodbot-20220925014630981800000002]
module.eventbridge.aws_cloudwatch_event_rule.this["cron"]: Refreshing state... [id=cron-rule]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=bloodbot]
module.eventbridge.aws_cloudwatch_event_target.this["lambda-cron"]: Refreshing state... [id=cron-rule-terraform-20220925015638232100000001]
module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["cron"]: Refreshing state... [id=cron]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2edd945963deed215f35f79bad313cce6157f2f42780d5e27b3e460df68650d7.zip" -> "builds/0a3a3c32d95369455664ce702011ae6926ff2cbcefbd882d1cb9f2b50cd0c89d.zip"
        id                             = "bloodbot"
      ~ last_modified                  = "2022-09-25T04:03:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:573908012280:function:bloodbot:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:573908012280:function:bloodbot:11/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SLACK_WEBHOOK_URL" = (sensitive)
                # (1 unchanged element hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["cron"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "bloodbot"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:events:ca-central-1:573908012280:rule/cron-rule"
      + statement_id        = "cron"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "./src/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "poetry",
                      + "python3.8",
                      + "./src",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./src",
                      + null,
                    ],
                ]
              + filename      = "builds/0a3a3c32d95369455664ce702011ae6926ff2cbcefbd882d1cb9f2b50cd0c89d.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0a3a3c32d95369455664ce702011ae6926ff2cbcefbd882d1cb9f2b50cd0c89d.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] is tainted, so must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8627039622919663006" -> (known after apply)
      ~ triggers = {
          ~ "filename"  = "builds/9d73d83e4f264963c2f5371f08d597247d7ac6ed8a988bd1046360af8044b80d.zip" -> "builds/0a3a3c32d95369455664ce702011ae6926ff2cbcefbd882d1cb9f2b50cd0c89d.zip"
          ~ "timestamp" = "1670702911798053000" -> "1670703120247822000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/0a3a3c32d95369455664ce702011ae6926ff2cbcefbd882d1cb9f2b50cd0c89d.zip"
          + "original_source_code" = "\"./src\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.


```

</details>

*Pushed by: @tribats, Action: `pull_request`*